package ru.oop.task1;

/**
 * Машина
 *
 * Класс представляет машину. Он нужен, чтобы создавать объект машины,
 * садить в неё человека и довозить до места назначения (насколько это возможно)
 *
 * @author MihailSap
 * @since 17.10.2025
 */
public class Car {

    /**
     * При создании машины мы садим в неё человека
     * Местоположение машины можно получить из человека
     */
    public Car(Person person) {

    }

    /**
     * Машина довозит человека до определенной позиции и высаживает
     */
    public void moveTo(Position destination){

    }
}
